# Configurações de Segurança

## Segurança de Senhas

### Criptografar Senhas no Roteador

Para evitar que as senhas sejam exibidas em texto simples na configuração, você pode criptografar todas elas.

**Comando:**
```
R1(config)# service password-encryption
```

### Definir Comprimento Mínimo de Senha

É importante garantir que as senhas tenham um comprimento mínimo para maior segurança. Defina o comprimento mínimo de caracteres para as senhas no roteador.

**Comando:**
```
R1(config)# security passwords min-length <tamanho_mínimo>
```

---

### Limitar Tentativas de Login

Você pode configurar o roteador para bloquear novas tentativas de login por um período de tempo se ocorrerem várias tentativas de login incorretas. Isso ajuda a evitar ataques de força bruta.

**Comando:**
```
R1(config)# login block-for <tempo_em_segundos> attempts <número_de_tentativas> within <intervalo_em_segundos>
```

**Exemplo:**
```
R1(config)# login block-for 120 attempts 3 within 60
```
Neste exemplo, se houver 3 tentativas de login com falha em 60 segundos, o roteador bloqueará novas tentativas por 120 segundos.


### Definir Tempo Máximo de Sessão EXEC

Por padrão, o roteador desconecta sessões inativas após 10 minutos. Você pode ajustar esse valor para um tempo menor para aumentar a segurança.

**Comando:**
```
R1(config-line)# exec-timeout <minutos> <segundos>
```

### **Exemplo Completo:**
```
R1(config)# service password-encryption
R1(config)# security passwords min-length 8
R1(config)# login block-for 120 attempts 3 within 60
R1(config)# line vty 0 4
R1(config-line)# password cisco123
R1(config-line)# exec-timeout 5 30
R1(config-line)# transport input ssh
R1(config-line)# end
```

---
## Habilitando SSH no Roteador

O protocolo SSH (Secure Shell) é uma maneira mais segura de acessar remotamente o roteador, pois criptografa o tráfego.

### Passo 1: Configurar um Nome de Host

O SSH exige que o dispositivo tenha um nome de host configurado.

**Comando:**
```
Router(config)# hostname <nome_do_host>
```

### Passo 2: Configurar o Nome de Domínio

Você também precisa definir um nome de domínio para gerar as chaves de criptografia.

**Comando:**
```
R1(config)# ip domain name <nome_do_domínio>
```

### Passo 3: Gerar Chaves RSA

Gere chaves RSA para criptografar o tráfego SSH. Quanto maior o número de bits, mais segura será a chave.

**Comando:**
```
R1(config)# crypto key generate rsa general-keys modulus <número_de_bits>
```

O tamanho recomendado para a chave é 1024 bits.


### Passo 4: Criar um Usuário Local

Crie uma conta de usuário com uma senha para autenticar o acesso SSH.

**Comando:**
```
R1(config)# username <nome_de_usuário> secret <senha>
```

### Passo 5: Configurar o Login Local

Defina o login local para autenticar as conexões SSH com base no banco de dados de usuários que você configurou.

**Comando:**
```
R1(config)# line vty 0 4
R1(config-line)# login local
```

### Passo 6: Habilitar o SSH

Especifique que apenas sessões SSH são permitidas nas linhas VTY, bloqueando conexões Telnet, que são menos seguras.

**Comando:**
```
R1(config-line)# transport input ssh
```

**Exemplo Completo:**
```
Router# configure terminal
Router(config)# hostname R1
R1(config)# ip domain name mynetwork.com
R1(config)# crypto key generate rsa general-keys modulus 1024
R1(config)# username admin secret securePass123
R1(config)# line vty 0 4
R1(config-line)# login local
R1(config-line)# transport input ssh
R1(config-line)# exit
```

---

## Desativando Serviços Não Utilizados

Desabilitar serviços desnecessários no roteador pode melhorar a segurança e o desempenho, fechando portas que poderiam ser exploradas por invasores.

### Exibir Portas Ativas

Para ver quais portas e serviços estão ativos no roteador:

**Comando:**
```
Router# show control-plane host open-ports
```

**Exemplo de Saída:**
```
Active internet connections (servers and established)
Prot   Local Address   Foreign Address   Service    State
tcp    *:23            *:0               Telnet     LISTEN
tcp    *:80            *:0               HTTP       LISTEN
udp    *:67            *:0               DHCP       LISTEN
```

### Desativar Serviços HTTP

Se o serviço HTTP não for necessário, você pode desativá-lo para aumentar a segurança.

**Comando:**
```
Router(config)# no ip http server
```
