# Configuração de Roteadores

## Configuração Básica

### Configurar o Nome do Dispositivo

O primeiro passo ao configurar um roteador é dar um nome ao dispositivo. Isso facilita a identificação na rede.

**Comando:**
```
Router(config)# hostname <nome_do_roteador>
```

**Exemplo:**
```
Router(config)# hostname Router1
```

### Proteger o Modo EXEC Privilegiado

O modo EXEC privilegiado é onde você faz alterações importantes no roteador. Por isso, é crucial protegê-lo com uma senha.

**Comando:**
```
Router(config)# enable secret <senha>
```

###  Proteger o Modo EXEC de Usuário (Acesso via Console)

Protege o acesso ao roteador pelo console físico, exigindo uma senha.

**Passos:**
```
Router(config)# line console 0
Router(config-line)# password <senha>
Router(config-line)# login
```

### Proteger o Acesso Remoto (Telnet/SSH)

Se você deseja acessar o roteador remotamente usando Telnet ou SSH, é necessário proteger essas conexões com uma senha.

**Passos:**
```
Router(config)# line vty 0 4
Router(config-line)# password <senha>
Router(config-line)# login
Router(config-line)# transport input {ssh | telnet}
```

- **Telnet**: Protocolo sem criptografia.
- **SSH**: Protocolo criptografado, preferível para segurança.

### Criptografar Senhas no Arquivo de Configuração

Para garantir que as senhas não sejam exibidas em texto simples nos arquivos de configuração, use o comando de criptografia.

**Comando:**
```
Router(config)# service password-encryption
```

### Adicionar um Aviso Legal (Banner MOTD)

Um banner MOTD (Mensagem do Dia) é uma mensagem que aparece para qualquer pessoa tentando acessar o roteador. É usado como aviso legal para desencorajar acessos não autorizados.

**Comando:**
```
Router(config)# banner motd <delimitador> <mensagem> <delimitador>
```

**Exemplo:**
```
Router(config)# banner motd # Acesso não autorizado é proibido! #
```

### Salvar a Configuração

Depois de configurar o roteador, é importante salvar as configurações para que elas não sejam perdidas após um reinício.

**Comandos:**
```
Router(config)# end
Router# copy running-config startup-config
```

## Configurando Interfaces de Rede no Roteador

As interfaces são onde o roteador se conecta à rede. Você precisa configurar o endereço IP e ativá-las.

**Passos:**

1. Entre no modo de configuração da interface:
   ```
   Router(config)# interface <tipo> <número>
   ```

2. Adicione uma descrição (opcional):
   ```
   Router(config-if)# description <descrição>
   ```

3. Defina o endereço IPv4 e a máscara de sub-rede:
   ```
   Router(config-if)# ip address <endereço_ipv4> <máscara_de_subrede>
   ```

4. Defina o endereço IPv6:
   ```
   Router(config-if)# ipv6 address <endereço_ipv6>/<tamanho_do_prefixo>
   ```

5. Ative a interface:
   ```
   Router(config-if)# no shutdown
   ```

**Exemplo Completo:**
```
R1(config)# interface gigabitEthernet 0/0/0
R1(config-if)# description Conexão com a LAN
R1(config-if)# ip address 192.168.10.1 255.255.255.0
R1(config-if)# ipv6 address 2001:db8:acad:10::1/64
R1(config-if)# no shutdown
R1(config-if)# exit
```


## Configurando Endereços IPv6

###  Endereços Globais Únicos (GUA)

Endereços GUA são usados para comunicação na Internet.

**Exemplo de configuração:**
```
R1(config)# interface gigabitEthernet 0/0/0
R1(config-if)# ipv6 address 2001:db8:acad:1::1/64
R1(config-if)# no shutdown
```

### Endereços de Link-Local (LLA)

Endereços LLA são usados para comunicação dentro da rede local (entre dispositivos na mesma rede).

**Exemplo de configuração:**
```
R1(config)# interface gigabitEthernet 0/0/0
R1(config-if)# ipv6 address fe80::1:1 link-local
R1(config-if)# no shutdown
```


## Habilitando Roteamento IPv6

Para que o roteador possa encaminhar pacotes IPv6, é necessário habilitar o roteamento unicast IPv6.

**Comando:**
```
ipv6 unicast-routing
```


## Configurando Rotas Estáticas

As rotas estáticas informam ao roteador como alcançar outras redes. Você pode definir o próximo salto (next hop) ou a interface pela qual os pacotes devem ser enviados.

**Comando:**
```
ip route <rede_destino> <máscara_de_subrede> <próximo_salto_ou_interface>
```

**Exemplos:**
```
ip route 192.168.2.0 255.255.255.0 10.0.0.1
```
```
ip route 192.168.2.0 255.255.255.0 gigabitEthernet 0/1
```

Para remover uma rota estática:
```
no ip route <rede_destino> <máscara_de_subrede> <próximo_salto_ou_interface>
```


## Verificando a Configuração do Roteador

###  Exibir Informações das Interfaces

Exibe todas as interfaces, seus endereços IP e status.

**Comandos:**
```
show ip interface brief
show ipv6 interface brief
```

###  Exibir Tabela de Roteamento

A tabela de roteamento contém informações sobre as rotas que o roteador conhece.

**Comandos:**
```
show ip route
show ipv6 route
```

### Exibir Estatísticas das Interfaces

Mostra detalhes sobre o desempenho e status das interfaces.

**Comando:**
```
show interfaces
```

### Exibir Estatísticas do IPv4

Mostra detalhes das configurações e desempenho do IPv4.

**Comando:**
```
show ip interfaces
```

### Exibir Estatísticas do IPv6

Mostra detalhes das configurações e desempenho do IPv6.

**Comando:**
```
show ipv6 interface
```
